Catalogs/СобытияHTTP.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Catalog>
		<Properties>
			<Name>СобытияHTTP</Name>
			<Comment>СобытияИнициированныеОборудованием, поступающие команды для обработки</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГруппаУсловий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыУсловий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвращатьОтвет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодФормированияОтвета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>HTTPName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Действия</Name>
					<Comment>Совершаемые действия</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Действие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГруппыДействий</v8:Type>
								<v8:Type>cfg:CatalogRef.Действия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаУсловий</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГруппыУсловий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОжидатьЗавершения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПеременныеДляПроцедуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПеременной</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
								<v8:TypeSet>cfg:BusinessProcessRoutePointRef</v8:TypeSet>
								<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
								<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfCalculationTypesRef</v8:TypeSet>
								<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>32</v8:Digits>
									<v8:FractionDigits>10</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ГруппыДействий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Catalog>
		<Properties>
			<Name>ГруппыДействий</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГруппаУсловий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыУсловий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Действия</Name>
					<Comment>Совершаемые действия</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Действие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Действия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаУсловий</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГруппыУсловий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОжидатьЗавершения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/СобытияHTTP/Ext/ManagerModule.bsl
Функция ОбработатьСобытие(ЭлементСправочника, ПараметрыЗапроса) Экспорт
	//Параметры - соответствие из запроса	
	
	Ответ = "";
	
	
	Если ЭлементСправочника.Активно Тогда  
		ГруппаУсловийВыполняется = Истина;
		Если ЗначениеЗаполнено(ЭлементСправочника.ГруппаУсловий) Тогда 
			ГруппаУсловийВыполняется = СерверПривилегированный.ПроверкаГруппыУсловий(ЭлементСправочника.ГруппаУсловий);
		КонецЕсли;
		Если ГруппаУсловийВыполняется Тогда 
			Для Каждого Строка Из ЭлементСправочника.Действия Цикл
				ГруппаУсловийДействияВыполняется = Истина; 
				Если ЗначениеЗаполнено(Строка.ГруппаУсловий) Тогда
					ГруппаУсловийДействияВыполняется = СерверПривилегированный.ПроверкаГруппыУсловий(Строка.ГруппаУсловий);
	            КонецЕсли;
				Если ГруппаУсловийДействияВыполняется Тогда
					Если ТипЗнч(Строка.Действие) = Тип("СправочникСсылка.Действия") Тогда // Это действие
						МассивСДействием = Новый Массив();
						МассивСДействием.Добавить(Строка.Действие);
						Если Строка.ОжидатьЗавершения Тогда		
							Справочники.Действия.ВыполнитьДействия(МассивСДействием);	
						Иначе
							МассивСПараметрамиДляДействий = Новый Массив();
							МассивСПараметрамиДляДействий.Добавить(МассивСДействием);
							ОбщегоНазначения.ВыполнитьПроцедуруФункциюВФонеНаСервере("Справочники.Действия.ВыполнитьДействия", МассивСПараметрамиДляДействий);	
						КонецЕсли;					
					ИначеЕсли ТипЗнч(Строка.Действие) = Тип("СправочникСсылка.ГруппыДействий") Тогда // Это группа действий
						Если Строка.ОжидатьЗавершения Тогда		
							Справочники.ГруппыДействий.ВыполнитьГруппуДействий(Строка.Действие);	
						Иначе
							МассивСПараметрамиДляГруппыДействий = Новый Массив();
							МассивСПараметрамиДляГруппыДействий.Добавить(Строка.Действие);
							ОбщегоНазначения.ВыполнитьПроцедуруФункциюВФонеНаСервере("Справочники.ГруппыДействий.ВыполнитьГруппуДействий", МассивСПараметрамиДляГруппыДействий);	
						КонецЕсли;		
					КонецЕсли;				
				КонецЕсли;		
			КонецЦикла;
			Если ЭлементСправочника.ВозвращатьОтвет Тогда
				ТекстПолученияПеременных = "";
				МассивЗначенийПеременных = Новый Массив();
				н = -1;
				Для Каждого СтрокаПеременной Из ЭлементСправочника.ПеременныеДляПроцедуры Цикл
					н = н + 1;
					ТекстПолученияПеременных = ТекстПолученияПеременных + СтрокаПеременной.ИмяПеременной + " = "
					+ "МассивЗначенийПеременных[" + н + "];" + Символы.ПС;
					МассивЗначенийПеременных.Добавить(СтрокаПеременной.Значение);		
				КонецЦикла;
				КодПроверкиУсловия = ТекстПолученияПеременных +	ЭлементСправочника.КодФормированияОтвета;
				Попытка 
					Выполнить(КодПроверкиУсловия);
				Исключение
					ОписаниеОшибки = "Ошибка при выполнении кода формирования ответа для элемента HTTPName = " + ЭлементСправочника.HTTPName + ". Описание ошибки = " + ОписаниеОшибки(); 
					ЗаписьВЖурналОшибок("Справочники.СобытияHTTP.МодульМенеджера", "ОбработатьСобытие", ОписаниеОшибки);
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
	
	
	Возврат Ответ;
	
КонецФункции
